---
type: OBJExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 16
tags: [revit-api, class]
---

# OBJExportOptions

`Autodesk.Revit.DB.OBJExportOptions` · Revit 2024 · 16 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | OBJExportOptions | — | `` |
| Constructor | OBJExportOptions | 2023 | `public OBJExportOptions ()` |
| Method | IsGridAspectRatioSet | 2023 | `public bool IsGridAspectRatioSet ()` |
| Method | IsMaxEdgeLengthSet | 2023 | `public bool IsMaxEdgeLengthSet ()` |
| Method | IsNormalToleranceSet | 2023 | `public bool IsNormalToleranceSet ()` |
| Method | IsSurfaceToleranceSet | 2023 | `public bool IsSurfaceToleranceSet ()` |
| Method | IsValidForGridAspectRatio | 2023 | `public static bool IsValidForGridAspectRatio ( double value )` |
| Method | IsValidForMaxEdgeLength | 2023 | `public static bool IsValidForMaxEdgeLength ( double value )` |
| Method | IsValidForNormalTolerance | 2023 | `public static bool IsValidForNormalTolerance ( double value )` |
| Method | IsValidForSurfaceTolerance | 2023 | `public static bool IsValidForSurfaceTolerance ( double value )` |
| Method | SetTessellationSettings | 2023 | `public void SetTessellationSettings ( ExportResolution resolutionType )` |
| Property | GridAspectRatio | 2023 | `public double GridAspectRatio { get ; set ; }` |
| Property | MaxEdgeLength | 2023 | `public double MaxEdgeLength { get ; set ; }` |
| Property | NormalTolerance | 2023 | `public double NormalTolerance { get ; set ; }` |
| Property | SurfaceTolerance | 2023 | `public double SurfaceTolerance { get ; set ; }` |
| Property | TargetUnit | 2023 | `public ExportUnit TargetUnit { get ; set ; }` |